app/helpers/application_helper.rb

  def current_order
    # Use Find by id to avoid potential errors
    if Order.find_by_id(session[:order_id]).nil?
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT ?  [["LIMIT", 1]]