app/controllers/pages_controller.rb

SELECT "foods".* FROM "foods"
---
  def menu
    @foods = Food.all